{
	"years": [
		{
			"year": 2016,
			"inductees": [
				{
					"name": "Betty Reed",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Betty%20Reed.jpg",
					"caption": "Committed to community service, compromise and cooperation, Reed introduced and passed legislation affecting health, education, the elderly, and those with disabilities."
				},
				{
					"name": "Lee Bird Leavengood",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Lee%20Leavengood.jpg",
					"caption": "As a leader in the founding of USF Leavengood forged a trail for women and seniors through her commitment to education, volunteerism and philanthropy."
				}
			]
		},
		{
			"year": 2015,
			"inductees": [
				{
					"name": "Josephine Howard Stafford",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Josephine.jpg",
					"caption": "Josephine Howard Stafford was born in Jacksonville, Texas, and grew up in Fayetteville, N.C. She received her Bachelor of Arts in 1941 from University of North Carolina, Greensboro, and her Bachelor of Laws (L.L.B.) in 1952, from the University of North Carolina Law School, Chapel Hill. She was inducted, as a Private, into the United States Marine Corps. During WWII, she wrote a newspaper column, \"The Voice of Femininity\" while aboard the U.S.S. Heintzelman."
				},
				{
					"name": "Matilda Martinez Garcia",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Matilda.jpg",
					"caption": "Matilda Martinez Garcia, devoted human rights advocate, was born in Tampa and is a second-generation Floridian. She has led an extraordinary life, witnessing both injustice and acceptance firsthand. Her resolve and energy for the welfare of others is legendary."
				},
				{
					"name": "Dr. Sylvia Marion Carley",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/carley.jpg",
					"caption": "Dr. Sylvia Marion Carley, Tampa native, retired Hillsborough Community College administrator and current President and CEO of Marion & Associates, continues to enhance our community. She received her Bachelor of Arts from Bethune-Cookman University; Master's Degree from Clark Atlanta University; Doctorate of Philosophy from the University of Florida; and a certificate in Higher Education Management from Harvard University."
				}
			]
		},
		{
			"year": 2014,
			"description": "The COSW would like to thank the Tampa Hillsborough Expressway Authority (Platinum Sponsor) and Richard and Susan Leisner (Gold Sponsors) for their support of the Hillsborough County Women's Hall of Fame Class of 2014.",
			"bookmark": "http://fl-hillsboroughcounty.civicplus.com/DocumentCenter/View/11543",
			"inductees": [
				{
					"name": "Ms. Nancy Ford",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/nancy%20ford%20pix%202.jpg",
					"caption": "A native and life‐long resident of Tampa, Nancy Torbett Ford was the only child of Dr. and Mrs. Ralph Torbett. She received a Bachelor of Artsin 1948 from Randolph‐Macon Woman's College in Virginia, and credited Randolph‐Macon with giving her confidence, leadership and volunteer opportunities, plus the firm belief that women can accomplish anything they want or need to do. Fittingly, in 1998 she was named an Alumna of Distinction by her alma mater."
				},
				{
					"name": "Senator Arthenia Joyner",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Joyner%20New%20picture.jpg",
					"caption": "Arthenia L. Joyner, representing Florida Senate District 19, is a dynamic individual whose personal life reads like a chronicle of the struggle for equal justice. She has not just lived history ‐‐ she made it. Born in Lakeland, Florida, Senator Joyner earned her Bachelor of Science degree from Florida A & M University in 1964 and Judicial Doctorate in 1968 from its College of Law. She was the first black female attorney in Polk and Hillsborough counties and has been in private practice for 45 years – longer than any other black woman in the history of Florida."
				},
				{
					"name": "Ms. Eleanor McWilliams Chamberlain",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Ella%20Collier%20McWilliams%20Chamberlain.jpeg",
					"caption": "Eleanor \"Ella\" Collier McWilliams was born in Iowa, the nation's first state to admit women to its public university. She was in the first generation of college women, often called \"co‐eds.\" In 1870, she married Fielding P. Chamberlain, a progressive and feminist advocate. They came to Florida in 1881 and settled in Tampa in 1883."
				}
			]
		},
		{
			"year": 2013,
			"program": "http://fl-hillsboroughcounty.civicplus.com/DocumentCenter/View/8419",
			"bookmark": "http://fl-hillsboroughcounty.civicplus.com/DocumentCenter/View/8438",
			"inductees": [
				{
					"name": "Dottie Berger MacKinnon	",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Dottie%20Berger%20MacKinnon.jpg",
					"caption": "Dottie Berger MacKinnon grew up on a farm in Kentucky, but left home at fifteen to live with relatives in Maryland. One of ten children, she often said, \"that you learn to form alliances, to compromise, to go with the flow.\""
				},
				{
					"name": "Deanne Dewey Roberts",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Deanne%20Roberts.jpg",
					"caption": "A fourth-generation Floridian, Deanne was born in Tampa and attended high school at the Academy of Holy Names. While there, she developed her speechwriting, debate and persuasive presentation skills, which would lead to a career in strategic communications and guide her professional path for the next 30 years. In 1974, she graduated from the University of South Florida with a Bachelor of Arts degree in Mass Communications."
				},
				{
					"name": "Dr. Juel Shannon Smith",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/JUEL%20PROFESSIONAL%20PHOTO.jpg",
					"caption": "Dr. Smith was born in Sapulpa, Oklahoma and graduated from Sapulpa High School in 1960 and from Langston University in Oklahoma in 1972 with a degree in Education. Dr. Smith relocated to Tampa and received her Masters and Education Specialist Degree with a Thesis on \"Women Who Combine Career and Family\" and a Ph.D. in Counselor Education in 1987 from the University of South Florida (USF)."
				}
			]
		},
		{
			"year": 2012,
			"program": "http://fl-hillsboroughcounty.civicplus.com/DocumentCenter/View/8418",
			"bookmark": "http://fl-hillsboroughcounty.civicplus.com/DocumentCenter/View/8437",
			"inductees": [
				{
					"name": "Phyllis Busansky",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/BusanskyPhyllis.JPG",
					"caption": "Phyllis Hendler Busansky was born in Hartford, Connecticut and graduated from Wheaton College with a bachelor's degree in English literature. She received an MBA from the Heller School at Brandeis University."
				},
				{
					"name": "Gwendolyn Miller",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Gwendolyn%20Miller.jpg",
					"caption": "Gwendolyn Martin Miller was born in Tampa, attended Middleton High School, and received her Bachelor of Science and Master of Education degrees from Florida A & M University. In 2003, she received the University's Distinguished Alumnus Award. She was an elementary school teacher for Hillsborough County from 1957-1970, and was the school district's Human Relations Specialist for 24 years."
				},
				{
					"name": "Jan Platt",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Plattcolor.jpg",
					"caption": "Jan Kaminis Platt was born in St. Petersburg, Florida. The family soon moved to Tampa, where Jan's civic and political career began. She was an exemplary student at Hillsborough High School, and was voted Most Likely to Succeed. Jan attended Girls State in Tallahassee, where she acquired her love for government."
				}
			]
		},
		{
			"year": 2011,
			"program": "http://fl-hillsboroughcounty.civicplus.com/DocumentCenter/View/8417",
			"inductees": [
				{
					"name": "Mary T. Cash",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Mary%20Cash.JPG",
					"caption": "Mary T. Brown Cash was born in Madison, Florida and came to Tampa from Ocala, in 1906, as an only child with her mother. Mary became an office person and maid for Dr. M.R. Winton, a white physician, who along with Clara C. Frye became her mentors. She graduated on November 16, 1916 from St. Agnes College of Nursing (Raleigh, North Carolina) and returned to work for Dr. M. R. Winton."
				},
				{
					"name": "Elizabeth \"Betty\" Castor",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Betty%20Castor.JPG",
					"caption": "Betty Castor was the first woman elected to the Florida Cabinet and the first female President Pro Tempore of the Florida Senate."
				},
				{
					"name": "Helen Gordon Davis",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Helen%20Gordon%20Davis.jpg",
					"caption": "A legislator for almost two decades, Helen Gordon Davis championed the civil rights of the disenfranchised, particularly women and minorities. Born in New York City, she moved to Tampa in 1946. In 1948, she was the first white woman in Florida to join the NAACP. That year she was one of two white women to join the Woolworth Lunchroom \"sit ins.\""
				},
				{
					"name": "Cecile Waterman Essrig ",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Ceceil%20Essrig.jpg",
					"caption": "Cecile W. Essrig was born in Tampa, Florida. In 1967, she was elected to the Hillsborough County School Board – the first woman to be elected to any major political office in the county. She served on the School Board for twenty-one years, including two terms as chair, until her retirement in 1988."
				},
				{
					"name": "Pat Collier Frank",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Pat%20Collier%20Frank.jpg",
					"caption": "Pat Collier Frank graduated from the University of Florida with a Bachelor of Science and a Bachelor of Arts degree and from Georgetown University School of Law, Washington, D.C. She has had a distinguished career in public service and elective office, commencing with her election to the Hillsborough County School Board (1972-1976) and serving as chair (1975-1976)."
				},
				{
					"name": "Sandra W. Freedman ",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Sandy%20Freedman.jpg",
					"caption": "Sandra Warshaw Freedman was born in Newark, New Jersey and moved with her family to Tampa when she was two years old. She graduated from Plant High School and received her Bachelor of Arts degree, in government, from the University of Miami (Florida) and was a former city, state and Florida intercollegiate tennis champion."
				},
				{
					"name": "Clara C. Frye",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Clara%20Frye.jpg",
					"caption": "Clara C. Frye was born in 1872 in Montgomery, Alabama, and trained in nursing care there arriving in Tampa around the turn of the century. She committed her life to providing medical care to Tampa's black citizens."
				},
				{
					"name": "Adela Hernandez Gonzmart",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Adela%20Gonzmart.jpg",
					"caption": "Adela Hernandez Gonzmart was born in Tampa, Florida. She graduated from Hillsborough High School with honors. After graduation from the Juilliard School of Music with a Bachelor's of Music and Science degree, she went on tour appearing in concerts at New York's Carnegie Hall, Washington, D.C., Havana, Cuba and throughout Florida."
				},
				{
					"name": "Sylvia Rodriguez Kimbell",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Sylvia%20Kimbel.jpg",
					"caption": "In 1990, Sylvia Rodriguez Kimbell became the first African- American woman to win a major political office when she was elected to Hillsborough County Board of County Commissioners from District 3. She later served as Chair and was re-elected in 1992."
				},
				{
					"name": "Sayde Gibbs Martin",
					"image_src": "http://fl-hillsboroughcounty.civicplus.com/images/pages/N3142/Sadye%20Gibbs%20Martin.jpg",
					"caption": "Sadye Gibbs Martin was the first woman Mayor of Plant City and the first female African American elected mayor of a major city in Florida. She was a graduate of Midway Academy, Plant City's high school that served the black community and received her B.S. degree at BethuneCookman College (Daytona, Florida) and earned a Master of Arts degree from the University of South Florida."
				}
			]
		}
	]
}
